export default {
  header: {
    nav: {
      Men: 'Чоловічі',
      Women: 'Жіночі',
      Kids: 'Дітям',
      Customise: 'Індивідуальне'
    },
    search: {
      placeholder: 'Пошук'
    },
    lang: {
      ua: 'Укр',
      en: 'Анг'
    }
  },
  promo: {
    title: 'just do it',
    subtitle: 
          `Втілення інновації, для витримки в найважчих умовах,
          оновлений дизайн забезпечує гнучкість
          та міцність матеріалів, саме там, де вони найбільше потрібні. `
  },
  sorting: {
    placeholder: 'Відсортувати за ...',
    options: {
      low: 'Від дешевих до дорогих',
      high: 'Від дорогих до дешевих',
      featured: 'Вибрані вами'
    }
  },
  catalog: {
    menu: {
      btn_shop: 'Придбати',
      btn_addCard: 'Додати картку'
    },
    form: {
      title: 'Створити нову картку',
      placeholder: {
        name: 'Введіть імя',
        price: 'Введіть ціну'
      },
      info: 'Натисніть комбінацію ctrl+1 для скидання правок в формі',
      submit: 'Додати',
      validate: {
        name: {
          min: 'Мінімум 4 символи',
          req: 'Обов*язкове поле!'
        },
        price: {
          min: 'Мінімальне число 10',
          req: 'Обов*язкове поле!',
          type: 'Введіть будь-ласка число'
        }
      }
    },
    slider: {
      price: 'Ціна :'
    }
  },
  modal: {
    total: 'Ціна: ',
    bag: 'В кошик',
    tnks: 'Чудовий вибір, гарного дня!'
  }
};
